# Ileri toplulastirma islemleri (Aggregate, filter, transform, apply)

In [7]:
import pandas as pd
import seaborn as sns
import numpy as np
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,11,52,23,43,55],
                  'degisken2': [100,252,33,252,111,969]}, columns=['gruplar', 'degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         11        252
2       C         52         33
3       A         23        252
4       B         43        111
5       C         55        969

In [3]:
#aggregate

In [4]:
df.groupby("gruplar")

In [5]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             16.5      176.0
B             27.0      181.5
C             53.5      501.0

In [8]:
df.groupby("gruplar").aggregate(["min",np.median,max]) #np.median'i tirnakla falan yazamayiz cunku farkli bir kutuphaneden geliyor, onu belirtmemiz lazim.

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.5  23       100  176.0  252
B              11   27.0  43       111  181.5  252
C              52   53.5  55        33  501.0  969

In [9]:
df.groupby("gruplar")["degisken1"].aggregate(["min",np.median,max])

         min  median  max
gruplar
A         10    16.5   23
B         11    27.0   43
C         52    53.5   55

In [10]:
df.groupby("gruplar").aggregate({"degisken1": "min", "degisken2": "max"})

         degisken1  degisken2
gruplar
A               10        252
B               11        252
C               52        969

array([121, 200, 150,  99], dtype=int64)